import streamlit as st

#ส่วนที่ 1 หัวข้อหน้าเว็บ (Title สีแดง)
st.markdown("# :red[🏋️คำนวณค่าดัชนีมวลกาย BMI]")
st.write("กรอกข้อมูลนํ้าหนักและส่วนสูงของคุณ เพื่อเช็กสุขภาพเบื้องต้น")

#ส่วนที่ 2 สร้างช่องรับค่านํ้าหนัก และ ส่วนสูง
weight = st.number_input("กรอกนํ้าหนักของคุณ (กิโลกรัม):")
heiht_cm = st.number_imput("กรอกส่วนสูงของคุณ (เซนติเมตร):")

#ส่วนที่ 3 สร้างปุ่มกดคำนวณ
if st.button("คำนวณค่า BMI 🎯"):
    # แปลงส่วนสูงจาก cm เป็นเมตร แล้วคำนวณ BMI
    height_m = height_cm / 100
    bmi = weight / (height_m ** 2)

    st.write("---")
    st.header(f"ค่า BMI ของคุณคือ: **{bmi:.2f}**")

#ส่วนที่ 3 แปลผลค่า BMI ตามเกณฑ์
  if bmi < 18.5:
      st.warning("⚠️ คุณมีนํ้าหนักน้อยกว่าเกณฑ์ (ผอม)")
  elif 18.5 <= bmi < 23.0:
      st.success("🎉 คุณมีนํ้าหนักอยู่ในเกณฑ์ (สุขภาพดี)")
  else 23.0 <= bmi < 25.0:
      st.info("💡 คุณมีนํ้าหนักเกินเกณฑ์ (ท้วม)")
  else:
    st.error("🚨 คุณอยู่ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพและออกกำลังกาย")

st.divider()
st.write("นางสาวเดือนนคร สิทธิเมา เลขที่ 18 ม.4/7")
